# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-11 20:19:28 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* kryLisp [6/8]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A naive Lisp interpreter, written in Python.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-03-11 Di 20:19]
   | Headline                  | Time    |         |       |      |      |
   |---------------------------+---------+---------+-------+------+------|
   | *Total time*              | *17:40* |         |       |      |      |
   |---------------------------+---------+---------+-------+------+------|
   | *kryLisp [6/8]*           | *17:40* |         |       |      |      |
   | \_  /Components [2/4]/    |         | /17:40/ |       |      |      |
   | \_    Parser [1/1]        |         |         |  5:36 |      |      |
   | \_      Ditch the Atom    |         |         |       | 0:41 |      |
   | \_    Interpreter [0/1]   |         |         | 12:04 |      |      |
   | \_      Refactoring [0/1] |         |         |       | 1:51 |      |
   | \_        Simplify        |         |         |       |      | 1:51 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [2/4]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE Parser [1/1]
    CLOSED: [2025-03-10 Mo 19:43]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-10 Mo 18:45]--[2025-03-10 Mo 18:46] =>  0:01
    CLOCK: [2024-05-19 So 17:33]--[2024-05-19 So 21:18] =>  3:45
    CLOCK: [2024-05-19 So 15:56]--[2024-05-19 So 17:05] =>  1:09
    :END:
**** DONE Ditch the Atom
     CLOSED: [2025-03-10 Mo 19:31]
     :LOGBOOK:
     CLOCK: [2025-03-10 Mo 18:50]--[2025-03-10 Mo 19:31] =>  0:41
     :END:
     The Atom type was a mistake, I should ditch it, and use plain str, int,
     float, and data.Symbol.
*** TODO Interpreter [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-11 Di 14:25]--[2025-03-11 Di 15:36] =>  1:11
    CLOCK: [2025-03-08 Sa 16:24]--[2025-03-08 Sa 22:49] =>  6:25
    CLOCK: [2024-05-20 Mo 14:29]--[2024-05-20 Mo 17:06] =>  2:37
    :END:
**** Refactoring [0/1]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
***** TODO Simplify
      :LOGBOOK:
      CLOCK: [2025-03-11 Di 18:27]--[2025-03-11 Di 20:18] =>  1:51
      :END:
      Right now, the interpreter is a long-winded, tangled mess of
      if-statements.
      I want to replace those, as far as feasible, with match-statements and
      lookup tables.
** Bugs [4/4]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE Linters to the rescue [3/3]
    CLOSED: [2025-03-10 Mo 19:42]
    I wrote a Lisp interpreter in Python many years ago (2010, apparently),
    and I am trying to copy some of the code, which makes the linters scream.
    The old code was written for Python 2, so ... no surprise there.
    So here's what I am going to do:
**** DONE Pacify the linters
     CLOSED: [2025-03-08 Sa 15:05]
     Fix everything the linters are barking at
**** DONE Add type hints
     CLOSED: [2025-03-08 Sa 15:05]
     Add type annotations, as far as possible and helpful
**** DONE Testing
     CLOSED: [2025-03-10 Mo 19:42]
     I should probably write some tests, too.
